Revit 2026 API

# StairsRunCreateSketchedRun Method

---
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static StairsRun CreateSketchedRun(
	Document document,
	ElementId stairsId,
	double baseElevation,
	IList<Curve> boundaryCurves,
	IList<Curve> riserCurves,
	IList<Curve> stairsPath
)
```
```vb
Public Shared Function CreateSketchedRun (
	document As Document,
	stairsId As ElementId,
	baseElevation As Double,
	boundaryCurves As IList(Of Curve),
	riserCurves As IList(Of Curve),
	stairsPath As IList(Of Curve)
) As StairsRun
```
```cpp
public:
static StairsRun^ CreateSketchedRun(
	Document^ document,
	ElementId^ stairsId,
	double baseElevation,
	IList<Curve^>^ boundaryCurves,
	IList<Curve^>^ riserCurves,
	IList<Curve^>^ stairsPath
)
```
```fsharp
static member CreateSketchedRun :
        document : Document *
        stairsId : ElementId *
        baseElevation : float *
        boundaryCurves : IList<Curve> *
        riserCurves : IList<Curve> *
        stairsPath : IList<Curve> -> StairsRun
```

#### Parameters

document Document

stairsId ElementId

baseElevation Double

boundaryCurves IListCurve

riserCurves IListCurve

stairsPath IListCurve

#### Return Value

StairsRun

#### Reference

StairsRun Class

Autodesk.Revit.DB.Architecture Namespace